'use strict';

module.exports = appInfo => {

  return {
    // should change to your own
    keys: appInfo.name + '123456',
    secret: '123456',

    // 今日哈工大地址
    todayUrl: 'http://today.hit.edu.cn',
    // 今日哈工大返回 pageSize
    todaySize: 3,
    // 今日哈工大爬虫地址 MAP
    todayMap: {
      som: {
        id: 3,
        name: '管理学院',
      },
      cs: {
        id: 14,
        name: '计算机科学与技术学院',
      },
      sa: {
        id: 53,
        name: '航天学院',
      },
      fls: {
        id: 48,
        name: '外国语学院',
      },
    },
    // 今日哈工大特定新闻打底缩略图
    todayNewsFirstImageDefaultArr: [
      'https://okujk9avg.bkt.clouddn.com/20170302148846166491367.png',
      'https://okujk9avg.bkt.clouddn.com/20170302148846173968927.png',
      'https://okujk9avg.bkt.clouddn.com/20170302148846178813468.png'
    ],

    // 心知天气 API 需要
    // https://api.thinkpage.cn/v3/weather/now.json?key :vzjfy7yvepyzv0ay&location :haerbin&language :zh-Hans&unit :c
    weatherUrl: 'https://api.thinkpage.cn/v3/weather/now.json',
    weatherKey: 'vzjfy7yvepyzv0ay',
    weatherErrorTips: '亲！天气查询接口好像疯了~',

    foodCard: {
      site: 'http://172.31.7.16', // base
      homeLogin: '/homeLogin.action', // 首页
      checkpicCode: '/getCheckpic.action?rand=4015.2017842046916', // 验证码地址
      loginStudent: '/loginstudent.action', // 登录地址
      accountcardUser: '/accountcardUser.action', // 获取用户信息
      accounttodatTrjnObject: '/accounttodatTrjnObject.action', // 查询当日
      accounthisTrjn: '/accounthisTrjn.action', // 历史查询
    },

    expressAPI: {
      identification: 'http://api.kdniao.cc/Ebusiness/EbusinessOrderHandle.aspx',
      EBusinessID: '1283169',
      key: 'd348067b-7165-4725-8526-8fd230648daf',
    },

    emptySchool: {
      site: 'http://jwts.hit.edu.cn/kjscx/queryKjs_wdl',
      xiaoquMap: JSON.parse('{"一校区":"1","二校区":"2"}'),
      houseMap: JSON.parse('{"8号楼":"001","主楼":"002","其他":"003","其它":"004","制造楼":"005","土木楼":"006","学士楼":"007","新技术楼":"010","机房":"011","机械楼":"012","材料楼":"013","校部楼":"014","格物楼":"015","正心楼":"016","理学楼":"018","电机楼":"019","科学园":"020","管理学院楼":"021","管理楼":"022","综合实验楼":"023","综合楼":"024","致知楼":"025","节能楼":"026","诚意楼":"027","语音室":"028","调课":"029","动力楼":"047","奥校楼":"049"}'),
      houseTwoMap: JSON.parse('{"文体中心":"009","一区":"030","一区主楼":"031","东配楼":"032","主楼":"033","二区":"035","五公寓":"036","交通学院":"037","图书馆":"038","土木学院":"040","土木楼":"041","西配楼":"042","车库楼":"043","青年公寓":"044","市政学院":"046","理化楼":"048"}'),
      liveMap: {
        正心楼: JSON.parse('{"正心1002":"0212","正心1004":"0213","正心1006":"0214","正心1008":"0215","正心1010":"0216","正心1013":"0217","正心1014":"0218","正心1018":"0219","正心103":"0220","正心105":"0221","正心106":"0222","正心109":"0223","正心11":"0224","正心111":"0225","正心112":"0226","正心116":"0227","正心117":"0228","正心12":"1554","正心120":"0230","正心122":"0231","正心13":"0232","正心14":"0233","正心203":"0234","正心205":"0235","正心207":"0236","正心209":"0237","正心21":"0238","正心210":"0239","正心213":"0240","正心215":"0241","正心217":"0242","正心22":"0243","正心220":"0244","正心221":"0245","正心224":"0246","正心226":"0247","正心23":"0248","正心24":"0249","正心303":"0250","正心304":"0251","正心306":"0252","正心308":"0253","正心31":"0254","正心310":"0255","正心311":"0256","正心314":"0257","正心316":"0258","正心318":"0259","正心32":"0260","正心320":"0261","正心322":"0262","正心324":"0263","正心327":"0264","正心328":"0265","正心33":"0266","正心332":"0267","正心34":"0268","正心403":"0269","正心404":"0270","正心406":"0271","正心408":"0272","正心41":"0273","正心410":"0274","正心411":"0275","正心414":"0276","正心416":"0277","正心418":"0278","正心42":"0279","正心420":"0280","正心422":"0281","正心424":"0282","正心427":"0283","正心428":"0284","正心43":"0285","正心432":"0286","正心44":"0287","正心503":"0288","正心504":"0289","正心506":"0290","正心508":"0291","正心510":"0292","正心511":"0293","正心514":"0294","正心516":"0295","正心518":"0296","正心520":"0297","正心522":"0298","正心524":"0299","正心527":"0300","正心528":"0301","正心532":"0302","正心606":"0303","正心608":"0304","正心610":"0305","正心611":"0306","正心614":"0307","正心616":"0308","正心618":"0309","正心620":"0310","正心622":"0311","正心624":"0312","正心627":"0313","正心628":"0314","正心632":"0315","正心703":"0316","正心704":"0317","正心706":"0318","正心708":"0319","正心710":"0320","正心711":"0321","正心714":"0322","正心716":"0323","正心718":"0324","正心720":"0325","正心722":"0326","正心724":"0327","正心727":"0328","正心728":"0329","正心732":"0330","正心803":"0331","正心804":"0332","正心806":"0333","正心808":"0334","正心810":"0335","正心811":"0336","正心814":"0337","正心816":"0338","正心818":"0339","正心820":"0340","正心822":"0341","正心824":"0342","正心827":"0343","正心828":"0344","正心832":"0345","正心903":"0346","正心904":"0347","正心906":"0348","正心908":"0349","正心910":"0350","正心911":"0351","正心914":"0352","正心916":"0353","正心918":"0354","正心920":"0355","正心922":"0356","正心924":"0357","正心927":"0358","正心928":"0359","正心932":"0360","正心舞美室":"0896","正心D121":"0897","正心701":"1395"}'),
        诚意楼: JSON.parse('{"诚意102":"0438","诚意103":"0439","诚意107":"0440","诚意11":"0441","诚意113":"0442","诚意114":"0443","诚意115":"0444","诚意12":"0445","诚意202":"0446","诚意203":"0447","诚意206":"0448","诚意207":"0449","诚意21":"0450","诚意212":"0451","诚意213":"0452","诚意215":"0453","诚意22":"0454","诚意302":"0455","诚意303":"0456","诚意306":"0457","诚意307":"0458","诚意31":"0459","诚意312":"0460","诚意313":"0461","诚意315":"0462","诚意32":"0463","诚意402":"0464","诚意403":"0465","诚意406":"0466","诚意407":"0467","诚意41":"0468","诚意412":"0469","诚意413":"0470","诚意415":"0471","诚意42":"0472","诚意502":"0473","诚意503":"0474","诚意506":"0475","诚意507":"0476","诚意51":"0477","诚意510":"0478","诚意512":"0479","诚意513":"0480","诚意515":"0481","诚意52":"0482","诚意602":"0483","诚意603":"0484","诚意606":"0485","诚意607":"0486","诚意612":"0487","诚意613":"1441","诚意616":"1442"}'),
      },
      cookie: 'name=value; UM_distinctid=15ac18eb74baff-05ba1cdf67c7e-1c3e6b52-1fa400-15ac18eb74c40f; _ga=GA1.3.322021877.1478674671; JSESSIONID=vL6bZVgPL5K2GJgGRC0r1hfNfHQp1kvLsQhy6wJXjnTGy9yv56nm!69194543; clwz_blc_pst=50335916.24859',
      host: 'jwts.hit.edu.cn',
      origin: 'http://jwts.hit.edu.cn',
      referer: 'http://jwts.hit.edu.cn/kjscx/queryKjs_wdl',
      userAgent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/57.0.2987.133 Safari/537.36'
    },

    aMap: {
      key: '0fadccdaab645f1dcd61715f6d19812e',
      geoCodeUrl: 'http://restapi.amap.com/v3/geocode/regeo',
      weatherUrl: 'http://restapi.amap.com/v3/weather/weatherInfo',
    },

    pt: {
      site: 'http://pt.hit.edu.cn',
      saleSite: 'http://pt.hit.edu.cn/forums.php?action=viewforum&forumid=46',
      topicSite: 'http://pt.hit.edu.cn/forums.php?action=viewtopic&forumid=46',
      cookies: 'c_secure_uid=NDUxMzg%3D; c_secure_pass=f430d5af82573dceb6cc87e9280581cf; c_secure_ssl=bm9wZQ%3D%3D; c_secure_tracker_ssl=bm9wZQ%3D%3D; c_secure_login=bm9wZQ%3D%3D; QSESSION=df718ee610d11cf44e2d6be5fe99abb6%2FldxGsYvQ1PMpZJ2Zl0MjuB83.nSGoerY7U5sMfy7O.LICUNvRa4q; QPTUID=45138; UM_distinctid=15ac18eb74baff-05ba1cdf67c7e-1c3e6b52-1fa400-15ac18eb74c40f; ptbrowser=yes; _ga=GA1.3.322021877.1478674671; _gat=1',
      defaultImg: '//okujk9avg.bkt.clouddn.com/20170420149269309041988.png',
    },

    // middleware
    middleware: [
      'robot',
      //'gzip',
    ],

    // detail for middleware
    robot: {
      ua: [
        /Baiduspider/i,
      ],
    },
    gzip: {
      threshold: 10240,
    },
    bodyParser: {
      jsonLimit: '8mb',
      formLimit: '8mb',
    },
    multipart: {
      fileExtensions: [

      ],
    },
    mongoose: {
      url: 'mongodb://127.0.0.1/WeHIT',
      options: {},
    },
    security: {
      csrf: {
        ignoreJSON: true, // 默认为 false，当设置为 true 时，将会放过所有 content-type 为 `application/json` 的请求
      },
    },
  };
};
